Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Using a [Relay service](https://docs.bsky.app/docs/advanced-guides/federation-architecture#relay) we can listen to an aggregated firehose of these events across all users in the network. In our case what we're looking for are valid `xyz.statusphere.status` records.
ja: [リレーサービス](https://docs.bsky.app/docs/advanced-guides/federation-architecture#relay)を使用すると、ネットワーク内のすべてのユーザーにわたってイベントが集約されたfirehoseを取得できます。今回探しているのは有効な`xyz.statusphere.status`レコードです。

source: Using the atproto identity system gives applications the tools for end-to-end encryption, signed user data, service sign-in, and general interoperation.
ja: このシステムを採用すると、エンドツーエンドの暗号化、署名されたユーザーデータ、サービスサインイン、および一般的な相互運用のためのツールがアプリケーションに提供されるはずです。

source: Value:
ja: 値：

source: Verification Settings
ja: 認証設定

source: Verification failed, please try again.
ja: 認証に失敗しました。再度試してください。

source: Verification settings
ja: 認証設定

source: Verifications on Bluesky work differently than on other platforms. <0>Learn more here.</0>
ja: Blueskyでの認証は他のプラットフォームとは異なります。<0>詳細はこちら</0>

source: Verified by:
ja: 認証者：

source: Verified user: `blurs=none` + `severity=inform`
ja: 認証済ユーザー：`blurs=none` + `severity=inform`

source: Verify DNS Record
ja: DNSレコードを確認

source: Verify Text File
ja: テキストファイルを確認

source: Verify account
ja: アカウントを認証

source: Verify again
ja: 再度認証する

source: Verify code
ja: コードを確認する

source: Verify email code
ja: メールのコードを確認

source: Verify email dialog
ja: メールアドレス確認ダイアログ

source: Verify now
ja: 認証する

source: Verify phone number
ja: 電話番号を確認

source: Verify this account?
ja: このアカウントを認証しますか？

source: Verify your age
ja: 年齢を認証する

source: Verify your email
ja: メールアドレスを確認

source: Verifying
ja: 認証中

source: Verifying your age assurance status
ja: 年齢保証ステータスを確認中

source: Verifying...
ja: 確認中…

source: Version {0}
ja: バージョン {0}

source: Very simple applications can include all endpoints under a single NSID “group”
ja: 非常に単純なアプリケーションであれば、すべてのエンドポイントを単一のNSIDグループに含めることができます

source: Video
ja: ビデオ

source: Video Feed
ja: ビデオフィード

source: Video Games
ja: ビデオゲーム

source: Video failed to process
ja: ビデオの処理に失敗

source: Video from {0}: {text}
ja: {0}からのビデオ：{text}

source: Video is paused
ja: ビデオは一時停止中です

source: Video is playing
ja: ビデオを再生中です

source: Video not found.
ja: ビデオが見つかりません。

source: Video settings
ja: ビデオの設定

source: Video uploaded
ja: ビデオをアップロードしました

source: Video uploads differ slightly from image uploads, since they are typically much larger files and have a significantly long processing time. Individual Atmosphere apps or CDNs may impose additional limits on video uploads.
ja: 動画のアップロードは画像のアップロードとは少し異なり、通常はファイルがとても大きく、処理時間も大幅に長くなります。個々のAtmosphereアプリやCDNは、動画のアップロードに追加の制限を課す場合があります。

source: Video: {0}
ja: ビデオ：{0}

source: Videos
ja: ビデオ

source: Videos must be less than 3 minutes long.
ja: ビデオは3分未満でなければなりません。

source: Videos will need time to transcode using a tool like `ffmpeg` on the server side before they are available from the firehose. This can lead to UX gaps — if a video blob is accompanying a new post, the video service only knows about the video once the post appears in the firehose. This means that people will be able to see the post before processing is complete, which will show a missing video for several seconds.
ja: 動画は、サーバー側で`ffmpeg`のようなツールを使用してトランスコードするのに時間がかかります。これによりUXのギャップが生じる可能性があります。新しい投稿に動画のblobが付随している場合、動画サービスは投稿がfirehoseに現れるまで動画について知ることができません。つまり、処理が完了する前に投稿を見ることができ、その間に数秒間動画が表示されないことになります。

source: View
ja: 表示

source: View blocked user's profile
ja: ブロック中のユーザーのプロフィールを表示

source: View blogpost for more details
ja: 詳細についてのブログの記事を見る

source: View debug entry
ja: デバッグエントリーを表示

source: View details
ja: 詳細を表示

source: View full thread
ja: スレッドをすべて表示

source: View information about these labels
ja: これらのラベルに関する情報を見る

source: View more
ja: もっと表示

source: View more trending videos
ja: 話題のビデオをもっと見る

source: View post
ja: 投稿を表示

source: View profile
ja: プロフィールを表示

source: View the avatar
ja: アバターを表示

source: View the labeling service provided by @{0}
ja: @{0}によって提供されるラベリングサービスを見る

source: View this user's verifications
ja: このユーザーの認証情報を表示

source: View users who like this feed
ja: このフィードにいいねしたユーザーを見る

source: View video
ja: ビデオを表示

source: View your blocked accounts
ja: ブロックしたアカウントを見る

source: View your default post interaction settings
ja: 投稿への反応のデフォルト設定を表示

source: View your feeds and explore more
ja: フィードを表示し、さらにフィードを探す

source: View your moderation lists
ja: モデレーションリストを見る

source: View your muted accounts
ja: ミュートしたアカウントを見る

source: View your verifications
ja: あなたの認証情報を表示

source: View {0}'s avatar
ja: {0}のアバターを表示

source: View {0}'s profile
ja: {0}のプロフィールを表示

source: View {displayName}'s profile
ja: {displayName}のプロフィールを表示

source: Viewer-specific metadata should be optional and either indicated in descriptions or grouped under a sub-object. This makes schemas reusable between “public” and “logged-in” views, and makes it clearer what information will be available when.
ja: 閲覧者依存のメタデータはオプションであり、descriptionで示されているか、サブオブジェクトの下にグループ化される必要があります。これにより、スキーマが「公開」ビューと「ログイン」ビューの間で再利用可能になり、どの情報がいつ利用可能かが明確になります。

source: Views full image
ja: 画像全体を表示

source: Views video in immersive mode
ja: ビデオを没入モードで表示

source: Violence
ja: 暴力行為（暴力）

source: Violent or threatening content
ja: 暴力的または脅迫的なコンテンツ

source: Visit site
ja: サイトへアクセス

source: Visit your notification settings
ja: 通知設定を開く

source: Volume
ja: 音量

source: Warn
ja: 警告

source: Warn content
ja: コンテンツの警告

source: Warn content and filter from feeds
ja: コンテンツの警告とフィードからのフィルタリング

source: Watch now
ja: 今すぐ見る

source: We also have a [more minimal example](https://tangled.org/strings/did:plc:vmt7o7y6titkqzzxav247zrn/3mbujziyniw22) using the new [lex](https://www.npmjs.com/package/@atproto/lex) SDK and [tap](https://www.npmjs.com/package/@atproto/tap) TypeScript library.
ja: 新しい[lex](https://www.npmjs.com/package/@atproto/lex) SDKと[tap](https://www.npmjs.com/package/@atproto/tap)のTypeScriptライブラリを使った[より小さなサンプル](https://tangled.org/strings/did:plc:vmt7o7y6titkqzzxav247zrn/3mbujziyniw22)もあります。

source: We also provide a [TypeScript library](https://www.npmjs.com/package/@atproto/tap) for working with Tap. For more information, refer to [The AT Stack](/guides/the-at-stack#tap) and the [tap repository](https://github.com/bluesky-social/indigo/tree/main/cmd/tap).
ja: Tapを使うための[TypeScriptライブラリ](https://www.npmjs.com/package/@atproto/tap)も提供しています。詳細については、[The AT Stack](/guides/the-at-stack#tap)および[tapリポジトリ](https://github.com/bluesky-social/indigo/tree/main/cmd/tap)を参照してください。

source: We also provide a quick start guide for [deploying Tap](https://github.com/bluesky-social/indigo/blob/main/cmd/tap/RAILWAY_DEPLOY.md) to [Railway](https://railway.com/).
ja: また、[Railway](https://railway.com/)向けの[Tapデプロイのクイックスタートガイド](https://github.com/bluesky-social/indigo/blob/main/cmd/tap/RAILWAY_DEPLOY.md)も提供しています。

source: We also recommend these deep-dive articles by the team:
ja: チームによる次の深掘り記事もおすすめです。

source: We apply the highest privacy standards, and never share or sell your contact information.
ja: 当社は最高のプライバシー基準を適用し、お客様の連絡先情報を共有または販売することはありません。

source: We assume that a Personal Data Server may fail at any time, either by going offline in its entirety, or by ceasing service for specific users. The goal of the AT Protocol is to ensure that a user can migrate their account to a new PDS without the server's involvement.
ja: パーソナルデータサーバーは、完全にオフラインになるか、特定のユーザーに対するサービスを停止するかのいずれかによって、いつでも失敗する可能性があると想定しています。ATプロトコルの目的は、ユーザーがサーバーの関与なしに自分のアカウントを新しいPDSに移行できるようにすることです。

source: We can now communicate with `https://pds.com` to access Alice's data.
ja: これで、`https://pds.com`と通信してAliceのデータにアクセスできるようになりました。

source: We can resolve the handle the same way, resolving `_atproto.alice.com`, which returns the DID: `did:web:alice.com`
ja: 解決方法は同じく`_atproto.alice.com`で、DIDとして`did:web:alice.com`が得られます。

source: We could not connect to the service that provides this custom feed. It may be temporarily unavailable and experiencing issues, or permanently unavailable.
ja: このカスタムフィードを提供するサービスへ接続できませんでした。一時的に利用できなくなって問題が発生しているか、永久に利用できなくなっている可能性があります。

source: We could not find this list. It was probably deleted.
ja: このリストを見つけることができませんでした。おそらく削除されています。

source: We couldn't find any results for that hashtag.
ja: そのハッシュタグの検索結果は見つかりませんでした。

source: We couldn't find any results for that topic.
ja: そのトピックについての検索結果は見つかりませんでした。

source: We couldn't load this conversation
ja: この会話を読み込めませんでした

source: We delete hashes after matches are made
ja: 一致した後にハッシュを削除します

source: We don't store your friends' phone numbers or send any messages
ja: お友達の電話番号を保存したり、メッセージを送信したりしません

source: We estimate {estimatedTime} until your account is ready.
ja: あなたのアカウントが準備できるまで{estimatedTime}ほどかかります。

source: We have partnered with <0>KWS</0> to handle age verification. When you click "Begin" below, KWS will email you instructions to complete the verification process. If your email address has already been used to verify your age for another game or service that uses KWS, you won’t need to do it again. When you’re done, you'll be brought back to continue using Bluesky.
ja: 私たちは年齢確認のために<0>KWS</0>と提携しています。以下の「開始」をクリックすると、KWSは確認プロセスを完了するための指示をメールで送信します。 KWSを使っている別のゲームやサービスで年齢確認のためにあなたのメールアドレスをすでに使用している場合、再度確認をする必要はありません。確認を完了したら、戻ってきてBlueskyの使用を続けることができます。

source: We have sent another verification email to <0>{0}</0>.
ja: 別の確認コードを<0>{0}</0>へ送りました。

source: We hold identity in primacy and center it in the protocol design. Canonical user data exists in a fluid and commoditized hosting network that allows rich applications to be built on it.
ja: 私たちはIDを最優先とし、プロトコル設計の中心に据えています。正規のユーザーデータは流動的でコモディティ化されたホスティングネットワークに存在し、その上にリッチなアプリケーションを構築できます。

source: We looked very closely at using RDF but just didn't love the developer experience (DX) or the tooling it offered.
ja: 私たちはRDFの使用を非常に詳しく検討しましたが、開発者体験（DX）や提供ツールが気に入りませんでした。

source: We maintain a Feed Generator example in [TypeScript](https://github.com/bluesky-social/feed-generator). Refer to the GitHub readme to get started.
ja: [TypeScript](https://github.com/bluesky-social/feed-generator)でフィードジェネレーターの例を提供しています。始め方はGitHubのreadmeを参照してください。

source: We need to verify your number before we can look for your friends. A verification code will be sent to this number.
ja: お友達を探す前にあなたの番号を確認する必要があります。確認コードがこの番号に送信されます。

source: We never keep plain phone numbers
ja: 素の電話番号は決して保持しません

source: We only suggest follows if both people consent
ja: 双方が同意した場合のみ、以下のフォローを提案します

source: We provide a [PDS install script](https://github.com/bluesky-social/pds) that is designed to get you up and running with your own PDS on a modestly resourced VPS. This will enable you to host your own data repositories, create and manage accounts, and serve your self-hosted data in the wider Atmosphere network or any other Atmosphere app. This section of the docs will help you take that PDS to production.
ja: リソースが限定されたVPS上で独自のPDSを起動して実行するように設計された[PDSインストールスクリプト](https://github.com/bluesky-social/pds)を提供しています。これにより、自分のデータリポジトリをホストし、アカウントを作成・管理し、より広いAtmosphereネットワークまたは他のAtmosphereアプリにセルフホストされたデータを提供できます。このセクションは、PDSを本番環境に移行するのに役立つでしょう。

source: We ran out of posts from your follows. Here's the latest from <0/>.
ja: あなたのフォロー中のユーザーの投稿を読み終わりました。フィード<0/>内の最新の投稿を表示します。

source: We recommend selecting at least two interests.
ja: すくなくとも2つの「気になること」を選択するのをお勧めします。

source: We recommend these fantastic articles by community member [Dan Abramov](https://bsky.app/profile/danabra.mov):
ja: コミュニティメンバーの[Dan Abramov](https://bsky.app/profile/danabra.mov)による、素晴らしい記事をおすすめします。

source: We sent an email to <0>{0}</0> containing a link. Please click on it to complete the email verification process.
ja: <0>{0}</0>にリンクが含まれているメールを送信しました。メールアドレスの確認プロセスを完了するために、そのリンクをクリックしてください。

source: We use two interrelated forms of identifiers: _handles_ and _DIDs_. Handles are DNS names while DIDs are a [W3C standard](https://www.w3.org/TR/did-core/) with multiple implementations which provide secure & stable IDs. AT Protocol supports the DID PLC and DID Web variants.
ja: 私たちは、*ハンドル*と*DID*という2つの相互に関連する識別子形式を使用します。ハンドルはDNS名ですが、DIDは安全で安定したIDとして機能する[新しいW3C標準](https://www.w3.org/TR/did-core/)です。

source: We want engineers to feel comfortable using and creating new schemas, and we want developers to enjoy the DX of the system. Lexicon helps us produce strongly typed APIs which are extremely familiar to developers and which provides a variety of runtime correctness checks.
ja: 私たちは、エンジニアが新しいスキーマを快適に使用および作成できるようにし、開発者がシステムのDXを楽しめるようにしたいと考えています。Lexiconは、開発者にとって非常に馴染み深く、さまざまな実行時正確性チェックを提供する、厳密に型指定されたAPIの作成に役立ちます。

source: We were unable to determine if you are allowed to upload videos. Please try again.
ja: あなたがビデオのアップロードを許可されているかどうか判断できません。もう一度お試しください。

source: We were unable to load your birthdate preferences. Please try again.
ja: 生年月日の設定を読み込むことができませんでした。もう一度お試しください。

source: We were unable to load your configured labelers at this time.
ja: 現在設定されたラベラーを読み込めません。

source: We were unable to receive the verification due to a connection issue. It may arrive later. If it does, your account will update automatically.
ja: 接続に問題が発生したため、認証を受け取ることができませんでした。確認が完了したら、アカウントは自動的に更新されます。

source: We will cover how to: {{className: 'lead'}}
ja: 以下の方法について説明します。 {{className: 'lead'}}

source: We will let you know when your account is ready.
ja: アカウントの準備ができたらお知らせします。

source: We will notify you when we find your friends.
ja: お友達を見つけたらお知らせします。

source: We write records using a similar API. Since our goal is to write "status" records, let's look at how that will happen:
ja: 同様のAPIを使用してレコードを書き込みます。目標はステータスレコードを書き込むことなので、その方法を見てみましょう。

source: We'll call these our View servers.
ja: これらをビューサーバーと呼びます。

source: We'll explain the collection name shortly. Record keys are strings with [some restrictions](https://atproto.com/specs/record-key#record-key-syntax) and a couple of common patterns. The `"self"` pattern is used when a collection is expected to only contain one record which describes the user.
ja: コレクション名については後ほど説明します。レコードキーは、[いくつかの制限](https://atproto.com/specs/record-key#record-key-syntax)といくつかの共通パターンを持つ文字列です。`"self"`パターンは、コレクションにユーザーを説明するレコードが1つだけ含まれると予想される場合に使用されます。

source: We'll send an email to <0>{0}</0> containing a link. Please click on it to complete the email verification process.
ja: <0>{0}</0>にリンクが含まれているメールを送信します。メールアドレスの確認プロセスを完了するために、そのリンクをクリックしてください。

source: We'll use this to help customize your experience.
ja: これはあなたの体験をカスタマイズするために使用されます。

source: We're also updating our <0>Community Guidelines</0>, and we want your input! These new guidelines will take effect on October 15th, 2025.
ja: <0>コミュニティガイドライン</0> も更新しますので、皆様のご意見をお聞かせください。新しいガイドラインは2025年10月15日より発効します。

source: We're also updating our Community Guidelines, and we want your input! These new guidelines will take effect on October 15th, 2025.
ja: コミュニティガイドラインも更新しますので、皆様のご意見をお聞かせください。新しいガイドラインは2025年10月15日より施行されます。

source: We're confirming your age assurance status with our servers. This should only take a few seconds.
ja: サーバーで年齢保証のステータスを確認しています。数秒かかります。

source: We're going to accomplish this using OAuth ([spec](https://github.com/bluesky-social/proposals/tree/main/0004-oauth)). Most of the OAuth flows are going to be handled for us using the [@atproto/oauth-client-node](https://github.com/bluesky-social/atproto/tree/main/packages/oauth/oauth-client-node) library. This is the arrangement we're aiming toward:
ja: これをOAuth（[spec](https://github.com/bluesky-social/proposals/tree/main/0004-oauth)）を使用して実現します。OAuthフローのほとんどは、[@atproto/oauth-client-node](https://github.com/bluesky-social/atproto/tree/main/packages/oauth/oauth-client-node)ライブラリで処理されます。私たちが目指している構成は以下のようになります。

source: We're going to establish a shared data model called the [“user data repository.”](/guides/data-repos)
ja: [ユーザーデータリポジトリ](/guides/data-repos)と呼ばれる共有データモデルを確立します。

source: We're going to keep this light so you can quickly wrap your head around ATProto. There will be links with more information about each step. {{className: 'lead'}}
ja: ATプロトコルをすぐに理解できるように、ここでは簡単な内容に留めます。各ステップについて、詳細情報へのリンクがあります。 {{className: 'lead'}}

source: We're going to use the [Agent](https://github.com/bluesky-social/atproto/tree/main/packages/api) associated with the user's OAuth session to fetch this record.
ja: このレコードを取得するには、ユーザーのOAuthセッションに関連付けられた[エージェント](https://github.com/bluesky-social/atproto/tree/main/packages/api)を使用します。

source: We're having issues initializing the age assurance process for your account. Please <0>contact support</0> for assistance.
ja: あなたのアカウントの年齢保証手順の初期化に問題が発生しました。<0>サポートにお問い合わせください</0>。

source: We're having network issues, try again
ja: ネットワークで問題が発生しています。もう一度試してください

source: We're off to a good start &mdash; we can read and write JSON documents in the user's repo. If they already have data from other apps (like a profile) we can read that data too. If we were building a singleplayer app, we'd already be done.
ja: 順調なスタートです。ユーザーのリポジトリでJSONドキュメントを読み書きできます。他のアプリ（プロファイルなど）から既にデータがある場合は、そのデータも読み取ることができます。シングルプレイヤーアプリを作成している場合は、すでに完了しています。

source: We're so excited to have you join us!
ja: 私たちはあなたが参加してくれることをとても楽しみにしています！

source: We're sorry! The post you are replying to has been deleted.
ja: 大変申し訳ありません！返信しようとしている投稿は削除されました。

source: We're sorry! We can't find the page you were looking for.
ja: 大変申し訳ありません！お探しのページは見つかりません。

source: We're sorry! You can only subscribe to twenty labelers, and you've reached your limit of twenty.
ja: 大変申し訳ありません！ラベラーは20までしか登録できず、すでに上限に達しています。

source: We're sorry, but based on your device's location, you are currently located in a region that requires age assurance.
ja: 申し訳ありません、デバイスの位置情報によれば、あなたは現在、年齢保証が必要な地域にいます。

source: We're sorry, but we were unable to resolve this list. If this persists, please contact the list creator, @{handleOrDid}.
ja: 大変申し訳ありませんが、このリストを解決できませんでした。それでもこの問題が解決しない場合は、作成者の@{handleOrDid}までお問い合わせください。

source: We're sorry, but we weren't able to load your muted words at this time. Please try again.
ja: 大変申し訳ありませんが、現在ミュートされたワードを読み込むことができませんでした。もう一度お試しください。

source: We're sorry, but your search could not be completed. Please try again in a few minutes.
ja: 大変申し訳ありませんが、検索を完了できませんでした。数分後にもう一度お試しください。

source: We're updating our policies
ja: ポリシーを更新しています

source: We've confirmed your age assurance status. You can now close this dialog.
ja: 年齢保証ステータスを確認しました。このダイアログを閉じることができます。

source: We've now arrived at a [stream processing architecture](https://milinda.pathirage.org/kappa-architecture.com/), and while there are a lot more details we could cover, this is enough for now.
ja: これで[ストリーム処理アーキテクチャ](https://milinda.pathirage.org/kappa-architecture.com/)に到達しました。さらに詳しく説明できる点はたくさんありますが、今のところはこれで十分です。

source: Welcome back!
ja: おかえりなさい！

source: Welcome, friend!
ja: ようこそ！

source: We’re introducing a new layer of verification on Bluesky — an easy-to-see checkmark.
ja: Blueskyに新しい認証方式を導入しました。見やすいチェックマークです。

source: We’re updating our <0>Terms of Service</0>, <1>Privacy Policy</1>, and <2>Copyright Policy</2>, effective September 15th, 2025.
ja: 2025 年 9 月 15 日をもって、<0>利用規約</0>、<1>プライバシー ポリシー</1>、<2>著作権ポリシー</2> を更新いたします。

source: We’re updating our Terms of Service, Privacy Policy, and Copyright Policy, effective September 15th, 2025.
ja: 2025 年 9 月 15 日より、利用規約、プライバシー ポリシー、著作権ポリシーを更新します。

source: We’re updating our Terms of Service, Privacy Policy, and Copyright Policy, effective September 15th, 2025. We're also updating our Community Guidelines, and we want your input! These new guidelines will take effect on October 15th, 2025. Learn more about these changes and how to share your thoughts with us by reading our blog post.
ja: 2025年9月15日より、利用規約、プライバシーポリシー、著作権ポリシーを更新いたします。また、コミュニティガイドラインも更新いたしますので、皆様のご意見をお聞かせください。新しいガイドラインは2025年10月15日より有効となります。変更内容の詳細とご意見の投稿方法については、ブログ記事をご覧ください。

source: What are your interests?
ja: なにに興味がありますか？

source: What do you want to call your starter pack?
ja: あなたのスターターパックを何と呼びたいですか？

source: What's up?
ja: 最近どう？

source: When a new post is discovered, you check if its text matches your search terms. If it does, you add it to your `postIndex` array. You'll also handle deletions and identity status changes to keep your index accurate.
ja: 新しい投稿が見つかったら、テキストが検索語に一致するか確認します。一致した場合は`postIndex`配列に追加します。さらに削除とIDステータス変更イベントも処理し、インデックスの正確性を保ちます。

source: When a record referencing blobs is deleted, the server checks if any other current records from the same repository reference the blob. If not, the blob is deleted along with the record.
ja: blobを参照するレコードが削除されると、サーバーは同じリポジトリの他の現存レコードがblobを参照しているかどうかを確認します。参照されていない場合、blobはレコードと一緒に削除されます。

source: When a repo is added, tap provides:
ja: リポジトリが追加されると、tapは以下を提供します。

source: When an account is deleted, all the hosted blobs are deleted, within some reasonable time frame. When an account is deactivated, takendown, or suspended, blobs should not be publicly accessible.
ja: アカウントが削除されると、ホストされているすべてのblobが適切な期間内に削除されます。アカウントが無効化、停止、または凍結された場合、blobは公開アクセス可能にすべきではありません。

source: When an account is registered on a PDS and a new identity (DID) is created:
ja: アカウントがPDSに登録され、新しいID（DID）が作成されたとき、以下のことが起こります。

source: When asking for a record, we provide three pieces of information.
ja: レコードを要求するときは、3つの情報を渡します。

source: When backfilling, you generally need to maintain 'up to date' replica of the data, which requires a cutover to streaming firehose data once the backfill is complete. We created `tap` to streamline this process.
ja: バックフィルを行うのは、一般にデータの最新レプリカを維持する必要がある場合なので、バックフィルが完了したらfirehoseデータのストリーミングへの切り替えが必要です。このプロセスを簡素化するために`tap`を作成しました。

source: When building your app, think in these four key steps:
ja: アプリを構築するときは、次の4つの重要な手順について考えます。

source: When making a write request to an AT API endpoint — such as when creating a new post — this full repository path will be returned as a response:
ja: AT APIエンドポイントに書き込みリクエストを行うとき（新しい投稿を作成する場合など）、この完全なリポジトリパスが応答として返されます。

source: When making requests to `getFeedSkeleton`, clients are encouraged to populate the `Accept-Language` HTTP header with comma-separated BCP-47 language codes e.g. `en`,`pr-BR`. Feed generators can use this language context to filter or rank posts. If language filtering is applied, the feed generator should use the the `Content-Language` response header indicating the parsed language codes.
ja: `getFeedSkeleton`にリクエストを送信する際、クライアントは`Accept-Language` HTTPヘッダーにカンマ区切りのBCP-47言語コード（例：`en`、`pr-BR`）を含めることが推奨されます。フィードジェネレーターはこの言語コンテキストを使用して投稿をフィルタリングまたはランク付けできます。言語フィルタリングが適用される場合、フィードジェネレーターはパースされた言語コードを示す`Content-Language`レスポンスヘッダーを使用する必要があります。

source: When somebody logs into our app, they'll give us read & write access to their personal `at://` repo. We'll use that to write the status json record.
ja: 誰かがアプリにログインすると、その人の個人用`at://`リポジトリへの読み取りおよび書き込みアクセス権が付与されます。これを使用して、ステータスjsonレコードを書き込みます。

source: When that finishes, the user will be sent back to `/oauth/callback` on our Web app. The OAuth client will store the access tokens for the user's server, and then we attach their account's [DID](https://atproto.com/specs/did) to the cookie-session.
ja: それが完了すると、ユーザーはウェブアプリの`/oauth/callback`に送り返されます。OAuthクライアントはユーザーのサーバーのアクセストークンを保存し、その後、アカウントの[DID](https://atproto.com/specs/did)をセッションCookieに添付します。

source: When the user logs in, the OAuth client will create a new session with their repo server and give us read/write access along with basic user info.
ja: ユーザーがログインすると、OAuthクライアントはリポジトリサーバーとの新しいセッションを作成し、基本的なユーザー情報とともに読み取り/書き込みアクセス権限を付与します。

source: When they submit the form, we tell our OAuth client to initiate the authorization flow and then redirect the user to their server to complete the process.
ja: ユーザーがフォームを送信すると、OAuthクライアントに認証フローを開始するように指示し、ユーザーをサーバーにリダイレクトしてプロセスを完了します。
